In [1]:
%pip install sklearn.preprocessing

Requirement already satisfied: sklearn.preprocessing in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (0.1.0)

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: pip3 install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder, OneHotEncoder

In [3]:
df=pd.read_csv('Titanic-Dataset.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
df.fillna(df['Age'].mean(), inplace=True)

In [15]:
df.fillna(df['Cabin'].mode()[0], inplace=True)

In [16]:
df.fillna(df['Embarked'].mode()[0], inplace=True)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [18]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [9]:
rangni_ozgartir=LabelEncoder()

In [10]:
df['Name']=rangni_ozgartir.fit_transform(df['Name'])

In [16]:
df['Name'].unique()

array([108, 190, 353, 272,  15, 554, 515, 624, 412, 576, 727,  95, 729,
        28, 840, 359, 682, 867, 839, 512, 273,  80, 523, 765, 626,  44,
       240, 260, 605, 813, 828, 776, 289, 856, 535, 372, 505, 134, 837,
       589,   7, 827, 446, 456, 212, 697, 473, 604, 726,  38, 629, 594,
       333, 246, 620, 873, 707, 595, 853, 299, 749, 385, 337, 755, 784,
       560, 596, 185,  25, 440, 396, 300, 376, 161,  87, 546, 778, 563,
       127, 223, 842, 737, 519, 141, 386,  52, 255, 764, 259, 149, 159,
        31, 150, 209, 184, 740, 292, 308, 219, 422, 656, 658, 858, 405,
       312, 542, 724, 559, 675, 552, 667, 882,  67, 417,  46, 645, 178,
       826,  70,  24, 362, 551, 575, 848, 857, 588, 525, 499, 653, 234,
       225, 165, 695, 851, 772, 685, 585, 271, 618, 282,  99, 597, 319,
       116,  32, 586,  29, 254, 580, 121,  68, 643, 532, 889, 612, 866,
       287, 181, 767, 716, 186, 847,  82, 129, 628, 293, 157, 760,  69,
       486, 832, 680, 408, 752, 769, 444, 464, 388, 320, 474, 717, 650,
        41,  76, 441, 700, 601, 698, 101, 823, 664, 136,  20, 579, 113,
       495, 533, 611, 497, 881, 834, 721, 403, 878, 166, 789,  51,   9,
       140,  94,  12, 131, 649, 288, 437, 582, 375, 390,  72, 338, 791,
       105, 306, 581, 379,  83, 531, 492, 243, 467, 339, 460, 754,  43,
       479, 329, 370, 172, 648, 383, 883, 567, 169, 500,  47, 539, 481,
       322,  78, 147, 673, 790, 782, 487, 702, 819, 808, 156, 844, 636,
       771,  42, 799, 340, 356, 674, 631, 652, 305,  91, 125, 817, 530,
       577, 350,  33, 482, 634, 681,   2, 227, 614, 887, 221, 770, 779,
       886, 570, 378, 177,  65,  90, 477, 315, 541, 478, 324,  17, 714,
        71, 431, 518, 411, 428, 868,  16, 248, 647,   3, 263, 348, 710,
       449, 355, 342, 590, 423, 555, 859, 775, 211, 200, 762, 128, 722,
       877, 598,  60, 295, 363, 517, 637, 304, 838, 265, 210, 642, 117,
       192,  93, 578, 258, 170, 733, 262, 111, 768, 207, 183, 215, 608,
       870, 237,  37, 879, 835, 104, 270, 522, 545, 759, 888,  64,  40,
       599,   5, 845, 562, 400,  48, 328, 863,  75, 690, 625, 536, 454,
       862,  85, 314,  86, 572, 811, 373, 665, 205, 298, 118, 715, 468,
       144, 393, 313, 583, 728, 404, 613, 524, 623, 821, 592,   6, 418,
       318, 616, 274, 861, 687,  88, 465, 732, 343, 540, 191, 792, 528,
       226, 742, 513, 829, 281, 155, 884, 198, 701, 872, 162, 662, 249,
       663,  92, 810, 491, 420, 744, 143, 253, 688, 261, 447, 344, 323,
       659, 679, 402, 216, 529, 735,  55, 661, 854, 316, 257, 290, 644,
       392, 537, 436, 815, 603,  21, 557, 280, 538, 502, 296, 132, 766,
       731,  54, 430, 124, 855, 401, 787, 164, 676, 107, 425, 365, 297,
       268, 706, 825,  89, 466, 381, 435, 774, 182, 317, 871, 547,  39,
       781, 880, 242, 738,  18, 796, 130, 133, 607, 450, 501, 646, 670,
       106, 610, 455, 195, 849, 521, 705, 168, 843, 472, 709,  35, 641,
       651, 841, 448, 364, 427, 244, 689, 245, 725, 366, 669, 818, 236,
       654, 123, 341, 120, 461, 692, 266, 188,  26,  27,  73, 222, 587,
        74, 622, 294, 203, 804, 736, 600, 463, 609, 874, 228, 693, 800,
       885, 558, 751, 593, 746, 527, 204, 786, 627, 217, 416, 336,  36,
       251, 432, 708, 639, 277, 745, 135, 419, 160, 805, 224, 703, 640,
       798, 395, 267, 284, 566, 691, 783, 238, 100, 154, 830, 470, 409,
        98, 229, 391, 761, 335, 816, 374, 483, 424, 199, 458, 741,  30,
       394, 568, 377, 110, 357, 197, 488,  77, 279, 875, 439, 573, 327,
       103, 794, 442, 490,  96, 602,  66, 494, 777, 635, 757, 206, 469,
       173, 633, 809, 397, 723, 758, 252,  53, 332, 180, 747, 865, 780,
       544, 218, 421, 606, 352, 360, 671, 102, 232, 584, 264,  57, 171,
       167, 484, 361, 119, 699, 179, 802, 114, 202, 543, 864, 846, 231,
       730, 824, 302, 137, 655, 345, 615, 301, 112, 457, 632, 194, 247,
       498, 213, 426, 452, 713, 850, 153, 433, 565, 803, 382,  45, 743,
        63, 275, 326, 556, 434, 126, 163, 561, 514, 443, 801, 459, 307,
       773, 241, 822, 520, 410, 331, 399, 286, 368, 151, 617, 677, 507,
       115, 387,  14, 346, 445,  84, 820, 869, 256, 476, 389, 574, 347,
       148, 711, 526, 788, 187,   1, 748, 511, 176, 852, 549, 833, 415,
       358, 321, 138,  58, 806, 704, 276, 591,  62, 146, 233, 369, 109,
       506, 553, 309, 480, 398, 496, 235, 367, 569, 812, 239, 438, 694,
        50, 214, 489, 414,  13, 330, 753, 683, 208, 310, 429, 278, 719,
       380, 201, 621, 462, 619, 384, 831, 666, 174, 142, 807, 351, 406,
        34, 660, 534, 152,  10, 475, 763,  23, 814, 269, 354, 504, 371,
       756, 349, 493, 678, 550, 630, 250, 453, 503, 516, 785, 876, 686,
       712,  49,  19, 175, 638, 750, 158, 508,  11, 564, 734, 471, 189,
         0, 720, 509, 334, 291,  22, 795,  97, 485, 145,   8, 860, 196,
        56, 672, 325, 283, 797, 718, 285, 122, 230, 696, 890, 407,  59,
        79, 139, 836,   4, 571, 311, 657, 451, 668, 739, 510, 193,  61,
       793, 684, 548, 303, 413,  81, 220])

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    int64
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(6), object(4)
memory usage: 83.7+ KB

In [13]:
df['Sex']=rangni_ozgartir.fit_transform(df['Sex'])

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    int64
 4   Sex          891 non-null    int64
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(7), object(3)
memory usage: 83.7+ KB

In [15]:
df['Sex'].unique()

array([1, 0])

In [17]:
df['Ticket']=rangni_ozgartir.fit_transform(df['Ticket'])

In [19]:
df['Cabin']=rangni_ozgartir.fit_transform(df['Cabin'])

In [20]:
df['Embarked']=rangni_ozgartir.fit_transform(df['Embarked'])

In [ ]:
rangni_ozgartir = df.select_dtypes(include=['object', 'category']).columns.tolist()
# bu code df ichidagi barcha matnli ustunlarni topadi va o'ziga saqlaydi
# bu code tepadagi alohida yozib chiqilgan code larning umumiy bitta qilib yozilgan variyanti,

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    int64
 4   Sex          891 non-null    int64
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    int64
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    int64
 11  Embarked     891 non-null    int64
dtypes: float64(2), int64(10)
memory usage: 83.7 KB

In [28]:
df['Age'].nunique()

89

In [29]:
df['Age'].value_counts()

Age
29.699118    177
24.000000     30
22.000000     27
18.000000     26
28.000000     25
            ...
36.500000      1
55.500000      1
0.920000       1
23.500000      1
74.000000      1
Name: count, Length: 89, dtype: int64

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    int64
 4   Sex          891 non-null    int64
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    int64
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    int64
 11  Embarked     891 non-null    int64
dtypes: float64(2), int64(10)
memory usage: 83.7 KB

In [ ]:
df['Age'] = df['Age'].astype(int) # bu yerda Age ustunini butun songa (int) o'tkazib oldik

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    int64
 4   Sex          891 non-null    int64
 5   Age          891 non-null    int64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    int64
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    int64
 11  Embarked     891 non-null    int64
dtypes: float64(1), int64(11)
memory usage: 83.7 KB

In [37]:
df['Fare'].value_counts()

Fare
8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
           ..
35.0000     1
28.5000     1
6.2375      1
14.0000     1
10.5167     1
Name: count, Length: 248, dtype: int64

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    int64
 4   Sex          891 non-null    int64
 5   Age          891 non-null    int64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    int64
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    int64
 11  Embarked     891 non-null    int64
dtypes: float64(1), int64(11)
memory usage: 83.7 KB

In [39]:
df['Fare']=df['Fare'].astype(int)

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    int64
 4   Sex          891 non-null    int64
 5   Age          891 non-null    int64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    int64
 9   Fare         891 non-null    int64
 10  Cabin        891 non-null    int64
 11  Embarked     891 non-null    int64
dtypes: int64(12)
memory usage: 83.7 KB

# shu yergacha barcha ustunlardagi datalarni tozalab oldik va ulardagi kamchiliklarni to'ldirdik

In [ ]:
df.dropna(axis=1, inplace=True)
 # kodining vazifasi NaN qiymatlar mavjud bo‘lgan ustunlarni olib tashlab, asl DataFrame-ni o‘z holida yangilashdir.

df.fillna(0, inplace=True) #kodi pandas DataFrame ichidagi NaN (bo‘sh yoki yetishmayotgan) qiymatlarni 0 bilan to‘ldirish uchun ishlatiladi.

In [44]:
encodedqilaman = pd.get_dummies(df, columns=['Age'], drop_first=False)
# bu code one hot encoded da matnli datalarni yangi ustunlar ochib sonli qilib saqlaydi

In [46]:
df['Age'].nunique()

71

In [47]:
encodedqilaman.info() # bu yerda alohida ustun qilib saqlanganini ko'ramiz

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 82 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    int64
 4   Sex          891 non-null    int64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    int64
 8   Fare         891 non-null    int64
 9   Cabin        891 non-null    int64
 10  Embarked     891 non-null    int64
 11  Age_0        891 non-null    bool
 12  Age_1        891 non-null    bool
 13  Age_2        891 non-null    bool
 14  Age_3        891 non-null    bool
 15  Age_4        891 non-null    bool
 16  Age_5        891 non-null    bool
 17  Age_6        891 non-null    bool
 18  Age_7        891 non-null    bool
 19  Age_8        891 non-null    bool
 20  Age_9        891 non-null    bool
 21  Age_10       891 non-null    bool
 22  Age_11       891 non-null    bool
 23  Age_12       891 non-null    bool
 24  Age_13       891 non-null    bool
 25  Age_14       891 non-null    bool
 26  Age_15       891 non-null    bool
 27  Age_16       891 non-null    bool
 28  Age_17       891 non-null    bool
 29  Age_18       891 non-null    bool
 30  Age_19       891 non-null    bool
 31  Age_20       891 non-null    bool
 32  Age_21       891 non-null    bool
 33  Age_22       891 non-null    bool
 34  Age_23       891 non-null    bool
 35  Age_24       891 non-null    bool
 36  Age_25       891 non-null    bool
 37  Age_26       891 non-null    bool
 38  Age_27       891 non-null    bool
 39  Age_28       891 non-null    bool
 40  Age_29       891 non-null    bool
 41  Age_30       891 non-null    bool
 42  Age_31       891 non-null    bool
 43  Age_32       891 non-null    bool
 44  Age_33       891 non-null    bool
 45  Age_34       891 non-null    bool
 46  Age_35       891 non-null    bool
 47  Age_36       891 non-null    bool
 48  Age_37       891 non-null    bool
 49  Age_38       891 non-null    bool
 50  Age_39       891 non-null    bool
 51  Age_40       891 non-null    bool
 52  Age_41       891 non-null    bool
 53  Age_42       891 non-null    bool
 54  Age_43       891 non-null    bool
 55  Age_44       891 non-null    bool
 56  Age_45       891 non-null    bool
 57  Age_46       891 non-null    bool
 58  Age_47       891 non-null    bool
 59  Age_48       891 non-null    bool
 60  Age_49       891 non-null    bool
 61  Age_50       891 non-null    bool
 62  Age_51       891 non-null    bool
 63  Age_52       891 non-null    bool
 64  Age_53       891 non-null    bool
 65  Age_54       891 non-null    bool
 66  Age_55       891 non-null    bool
 67  Age_56       891 non-null    bool
 68  Age_57       891 non-null    bool
 69  Age_58       891 non-null    bool
 70  Age_59       891 non-null    bool
 71  Age_60       891 non-null    bool
 72  Age_61       891 non-null    bool
 73  Age_62       891 non-null    bool
 74  Age_63       891 non-null    bool
 75  Age_64       891 non-null    bool
 76  Age_65       891 non-null    bool
 77  Age_66       891 non-null    bool
 78  Age_70       891 non-null    bool
 79  Age_71       891 non-null    bool
 80  Age_74       891 non-null    bool
 81  Age_80       891 non-null    bool
dtypes: bool(71), int64(11)
memory usage: 138.5 KB

In [49]:
encodedqilaman.head()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,...,Age_61,Age_62,Age_63,Age_64,Age_65,Age_66,Age_70,Age_71,Age_74,Age_80
0,1,0,3,108,1,1,0,523,7,147,...,False,False,False,False,False,False,False,False,False,False
1,2,1,1,190,0,1,0,596,71,81,...,False,False,False,False,False,False,False,False,False,False
2,3,1,3,353,0,0,0,669,7,147,...,False,False,False,False,False,False,False,False,False,False
3,4,1,1,272,0,1,0,49,53,55,...,False,False,False,False,False,False,False,False,False,False
4,5,0,3,15,1,0,0,472,8,147,...,False,False,False,False,False,False,False,False,False,False

In [50]:
encodedqilaman.astype(int) # bu yerda intga o'zgartirdim

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,...,Age_61,Age_62,Age_63,Age_64,Age_65,Age_66,Age_70,Age_71,Age_74,Age_80
0,1,0,3,108,1,1,0,523,7,147,...,0,0,0,0,0,0,0,0,0,0
1,2,1,1,190,0,1,0,596,71,81,...,0,0,0,0,0,0,0,0,0,0
2,3,1,3,353,0,0,0,669,7,147,...,0,0,0,0,0,0,0,0,0,0
3,4,1,1,272,0,1,0,49,53,55,...,0,0,0,0,0,0,0,0,0,0
4,5,0,3,15,1,0,0,472,8,147,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,548,1,0,0,101,13,147,...,0,0,0,0,0,0,0,0,0,0
887,888,1,1,303,0,0,0,14,30,30,...,0,0,0,0,0,0,0,0,0,0
888,889,0,3,413,0,1,2,675,23,147,...,0,0,0,0,0,0,0,0,0,0
889,890,1,1,81,1,0,0,8,30,60,...,0,0,0,0,0,0,0,0,0,0
890,891,0,3,220,1,0,0,466,7,147,...,0,0,0,0,0,0,0,0,0,0

In [51]:
encodedqilaman.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 82 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    int64
 4   Sex          891 non-null    int64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    int64
 8   Fare         891 non-null    int64
 9   Cabin        891 non-null    int64
 10  Embarked     891 non-null    int64
 11  Age_0        891 non-null    bool
 12  Age_1        891 non-null    bool
 13  Age_2        891 non-null    bool
 14  Age_3        891 non-null    bool
 15  Age_4        891 non-null    bool
 16  Age_5        891 non-null    bool
 17  Age_6        891 non-null    bool
 18  Age_7        891 non-null    bool
 19  Age_8        891 non-null    bool
 20  Age_9        891 non-null    bool
 21  Age_10       891 non-null    bool
 22  Age_11       891 non-null    bool
 23  Age_12       891 non-null    bool
 24  Age_13       891 non-null    bool
 25  Age_14       891 non-null    bool
 26  Age_15       891 non-null    bool
 27  Age_16       891 non-null    bool
 28  Age_17       891 non-null    bool
 29  Age_18       891 non-null    bool
 30  Age_19       891 non-null    bool
 31  Age_20       891 non-null    bool
 32  Age_21       891 non-null    bool
 33  Age_22       891 non-null    bool
 34  Age_23       891 non-null    bool
 35  Age_24       891 non-null    bool
 36  Age_25       891 non-null    bool
 37  Age_26       891 non-null    bool
 38  Age_27       891 non-null    bool
 39  Age_28       891 non-null    bool
 40  Age_29       891 non-null    bool
 41  Age_30       891 non-null    bool
 42  Age_31       891 non-null    bool
 43  Age_32       891 non-null    bool
 44  Age_33       891 non-null    bool
 45  Age_34       891 non-null    bool
 46  Age_35       891 non-null    bool
 47  Age_36       891 non-null    bool
 48  Age_37       891 non-null    bool
 49  Age_38       891 non-null    bool
 50  Age_39       891 non-null    bool
 51  Age_40       891 non-null    bool
 52  Age_41       891 non-null    bool
 53  Age_42       891 non-null    bool
 54  Age_43       891 non-null    bool
 55  Age_44       891 non-null    bool
 56  Age_45       891 non-null    bool
 57  Age_46       891 non-null    bool
 58  Age_47       891 non-null    bool
 59  Age_48       891 non-null    bool
 60  Age_49       891 non-null    bool
 61  Age_50       891 non-null    bool
 62  Age_51       891 non-null    bool
 63  Age_52       891 non-null    bool
 64  Age_53       891 non-null    bool
 65  Age_54       891 non-null    bool
 66  Age_55       891 non-null    bool
 67  Age_56       891 non-null    bool
 68  Age_57       891 non-null    bool
 69  Age_58       891 non-null    bool
 70  Age_59       891 non-null    bool
 71  Age_60       891 non-null    bool
 72  Age_61       891 non-null    bool
 73  Age_62       891 non-null    bool
 74  Age_63       891 non-null    bool
 75  Age_64       891 non-null    bool
 76  Age_65       891 non-null    bool
 77  Age_66       891 non-null    bool
 78  Age_70       891 non-null    bool
 79  Age_71       891 non-null    bool
 80  Age_74       891 non-null    bool
 81  Age_80       891 non-null    bool
dtypes: bool(71), int64(11)
memory usage: 138.5 KB

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    int64
 4   Sex          891 non-null    int64
 5   Age          891 non-null    int64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    int64
 9   Fare         891 non-null    int64
 10  Cabin        891 non-null    int64
 11  Embarked     891 non-null    int64
dtypes: int64(12)
memory usage: 83.7 KB